# Menata ulang Data Frame dengan mutiple indexes menggunakan unstack()

# Import Modules

In [1]:
import pandas as pd

print(pd.__version__)

2.1.4

# Persiapan Data Frame

In [4]:
df = pd.read_csv('D:/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,"1,1,""Allen, Miss. Elisabeth Walton"",female,29,...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"1,1,""Allison, Master. Hudson Trevor"",male,0.92...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"1,0,""Allison, Miss. Helen Loraine"",female,2,1,...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,"1,0,""Allison, Mr. Hudson Joshua Creighton"",mal...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,"1,0,""Allison, Mrs. Hudson J C (Bessie Waldo Da...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Data Frame dengan multiple indexes dari hasil groupping

In [5]:
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

Empty DataFrame
Columns: [survived]
Index: []

# Menata ulang Data Frame dengan mutiple indexes

In [6]:
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()

Empty DataFrame
Columns: []
Index: []